app/Controllers/Home.php

SELECT *
FROM `productos`
---
    public function index()
    {
        // Cargar el modelo de productos
        $productoModel = new ProductoModel();

        // Obtener todos los productos de la base de datos
        $productos = $productoModel->findAll();