app/Controllers/Producto.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '3'
---
    public function detalle($id)
    {
        // Obtener los detalles de un producto por su ID
        $productoModel = new ProductoModel();
        $data['producto'] = $productoModel->find($id);